CSI API ETABS v1
cPropMaterial.GetOTendon_1 Method
 Retrieves the other material property data for tendon materials.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetOTendon_1(
	string Name,
	ref double Fy,
	ref double Fu,
	ref int SSType,
	ref int SSHysType,
	ref double FinalSlope,
	double Temp = 0
)
Function GetOTendon_1 (
	Name As String,
	ByRef Fy As Double,
	ByRef Fu As Double,
	ByRef SSType As Integer,
	ByRef SSHysType As Integer,
	ByRef FinalSlope As Double,
	Optional Temp As Double = 0
) As Integer
Dim instance As cPropMaterial
Dim Name As String
Dim Fy As Double
Dim Fu As Double
Dim SSType As Integer
Dim SSHysType As Integer
Dim FinalSlope As Double
Dim Temp As Double
Dim returnValue As Integer
returnValue = instance.GetOTendon_1(Name,
	Fy, Fu, SSType, SSHysType, FinalSlope,
	Temp)
int GetOTendon_1(
	String^ Name,
	double% Fy,
	double% Fu,
	int% SSType,
	int% SSHysType,
	double% FinalSlope,
	double Temp = 0
)
abstract GetOTendon_1 :
        Name : string *
        Fy : float byref *
        Fu : float byref *
        SSType : int byref *
        SSHysType : int byref *
        FinalSlope : float byref *
        ?Temp : float
(* Defaults:
        let _Temp = defaultArg Temp 0
*)
-> int
Parameters
Name
Type: System.String
The name of an existing tendon material property.
Fy
Type: System.Double
Fu
Type: System.Double
The minimum tensile stress. [F/L2]
SSType
Type: System.Int32
This is 0, 1 or 2, indicating the stress-strain curve type.
Value | SSType
0 | User defined
1 | Parametric - 250 ksi strand
1 | Parametric - 270 ksi strand
SSHysType
Type: System.Int32
This is 0 through 7, indicating the stress-strain curve type.
Value | SSHysType
0 | Elastic
1 | Kinematic
2 | Takeda
3 | Pivot
4 | Concrete
5 | BRB Hardening
6 | Degrading
7 | Isotropic
FinalSlope
Type: System.Double
This item applies only to parametric stress-strain curves. It is a multiplier on the material modulus of elasticity, E. This value multiplied times E gives the final slope of the curve.
Temp (Optional)
Type: System.Double
The temperature at which the specified data to be retrieved. The temperature must have been defined previously for the material.
This item applies only if the specified material has properties that are temperature dependent. That is, it applies only if properties are specified for the material at more than one temperature.
Return Value
Type: Int32
Returns zero if the data is successfully retrieved; otherwise it returns a nonzero value. The function returns an error if the specified material is not tendon.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim Fy As Double
       Dim Fu As Double
       Dim SSType As Integer
       Dim SSHysType As Integer
       Dim FinalSlope As Double
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'initialize new material property
       ret = SapModel.PropMaterial.SetMaterial("Tendon", eMatType.Tendon)
   'assign other properties
       ret = SapModel.PropMaterial.SetOTendon_1("Tendon", 230, 255, 1, 1, -0.1)
   'get other properties
       ret = SapModel.PropMaterial.GetOTendon_1("Tendon", Fy, Fu, SSType, SSHysType, FinalSlope)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cPropMaterial Interface
ETABSv1 Namespace